12/data/attachments/13049c7e6dcf8423.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_76f57f86-887b-4498-a294-700f7abfc864</nif:username>
            <nif:friendToBeAdded>Marcus_the_Actions_63837_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>